In [3]:
import duckdb

# Connect to the database
con = duckdb.connect('../data/universities.duckdb')

# View Task 3 results
con.execute("""
    SELECT * FROM uk_france_china_counts
""").df()

# Explore all universities
con.execute("""
    SELECT country, COUNT(*) as count
    FROM all_universities
    GROUP BY country
    ORDER BY count DESC
    LIMIT 10
""").df()

              country  count
0       United States   2349
1               Japan    572
2               India    474
3               China    398
4             Germany    318
5  Russian Federation    309
6              France    297
7  Korea, Republic of    244
8      United Kingdom    195
9                Iran    193

In [12]:
# Task 5a: View enrollment percentages for 2010 and 2013
import duckdb

# Connect to the database
con = duckdb.connect('../data/universities.duckdb')

# View Task 3 results
con.execute("""
    SELECT * FROM uk_france_china_counts
""").df()

# Explore all universities
con.execute("""
SELECT 
    year,
    FORMAT('{:,}',ROUND(enrollment_rate, 6)) AS enrollment_rate,
    FORMAT('{:,}',CAST(total_enrolled AS BIGINT)) AS total_enrolled,
    FORMAT('{:,}',population) as population,
    total_enrolled_calculated,
    country,
    iso_code
FROM enrollment_percentages;
""").df()

,year,enrollment_rate,total_enrolled,population,total_enrolled_calculated,country,iso_code
0,2010,None,None,"309,378,227",False,United States,USA
1,2013,88.726418,"281,019,883","316,726,282",True,United States,USA
2,2010,None,"3,836,314","128,070,000",False,Japan,JPN
3,2013,62.838188,"3,862,749","127,445,000",False,Japan,JPN
4,2010,18.541767,"20,740,740","1,243,481,564",False,India,IND
5,2013,24.163833,"28,175,135","1,295,829,511",False,India,IND

In [14]:
# Task 5b: View global enrollment percentages for 2010
import duckdb

# Connect to the database
con = duckdb.connect('../data/universities.duckdb')

# View Task 3 results
con.execute("""
    SELECT * FROM uk_france_china_counts
""").df()

# Explore all universities
con.execute("""
    SELECT *
    FROM highest_enrollment_global_2010 
    order by total_enrolled desc limit 20
""").df()

               country iso_code  year  total_enrolled
0                China      CHN  2010        31046735
1                India      IND  2010        20740740
2               Brazil      BRA  2010         6552707
3            Indonesia      IDN  2010         5001048
4                Japan      JPN  2010         3836314
5   Iran, Islamic Rep.      IRN  2010         3790859
6              Turkiye      TUR  2010         3529334
7          Korea, Rep.      KOR  2010         3269509
8               Mexico      MEX  2010         2847376
9          Philippines      PHL  2010         2774368
10    Egypt, Arab Rep.      EGY  2010         2645832
11             Ukraine      UKR  2010         2635004
12           Argentina      ARG  2010         2520985
13      United Kingdom      GBR  2010         2479197
14            Thailand      THA  2010         2426577
15              France      FRA  2010         2245097
16              Poland      POL  2010         2148676
17            Viet Nam      VNM  2010         2020413
18               Italy      ITA  2010         1980399
19               Spain      ESP  2010         1878973